[
    {
      "_id": 1,
      "guid": "c5f839fb-d07b-44ac-aad0-26397c85fbc9",
      "friendlyUrl": "about",
      "status": "publish",
      "type": "article",
      "headline": "About Us",
	  "alternativeHeadline": "Aryashree Pritikrishna's portfolio and blogging site.",
	  "image": "http://www.etechbuddy.com/assets/images/profile_pic.jpg",
	  "author": "Aryashree Pritikrishna",
	  "award": "",
	  "editor": "eTechBuddy",
	  "genre": "Portfolio",
	  "keywords": "Portfolio",
	  "wordcount": "4336",
	  "publisher": "eTechBuddy.com",
	  "url": "http://www.etechbuddy.com/about",
	  "datePublished": "2012-12-16T18:30:00.000Z",
	  "dateCreated": "2012-12-16T18:30:00.000Z",
	  "dateModified": "2012-12-16T18:30:00.000Z",
	  "description": "Aryashree Pritikrishna's ideas on the open web, the future of digital, Open Source and Drupal.",
      "articleBody": "<div class='col'><div class='row'><div class='about-us-desc'><div class='col-md-12 col-sm-12'><div class='col-md-5 col-sm-12 user-image'><img src='assets/images/profile_pic.jpg' class='img-fluid img-thumbnail'><div class='social-media'><a href='https://www.facebook.com/aryashreep' target='_blank' class='fa fa-facebook' data-toggle='tooltip' title='Facebook'></a><a href='https://twitter.com/aryashreep' target='_blank' class='fa fa-twitter' data-toggle='tooltip' title='Twitter'></a><a href='https://www.linkedin.com/in/aryashreep' target='_blank' class='fa fa-linkedin' data-toggle='tooltip' title='Linkedin'></a><a href='mailto:aryashree@etechbuddy.com?Subject=Contact%20us%20eTechBuddy' target='_blank' class='fa fa-envelope' data-toggle='tooltip' title='aryashree@etechbuddy.com'></a><a href='tel:+918147450705' target='_blank' class='fa fa-phone' data-toggle='tooltip' title='+91 81474 50705'></a></div></div><p><h3>I’m A Professional Dude !</h3></p><p>I'm <strong>Aryashree Pritikrishna</strong>, basically from Odisha. Currently I am working in Bangalore as Technical Lead. I have more than 11 Years of experience in open source web application/web sites development :-). My personal focus is on server side programming, Web Application Architecture, Database design, release process, automation, and standards based web site design.</p><p>The primary technologies I use are PHP and MySQL, but programming is more about understanding the logic of process than the specific language you create it with. I utilize and advocate web standards like CSS and XHTML as much as possible because I believe that they are dramatically changing the Internet. Not to mention they make my life, and the clients life, easier and less expensive. These are just a few of my ideals I try to keep in mind when working. I also have a keen interest in Open Source Software projects such as Drupal, Joomla and WordPress, which I used to develop module, component and plugins.</p><p>My Philosophy A Web Application/ Web site, like any advertisement for a business, is a communication channel to your customers. If you want to effectively communicate with people your web site should be three things: <ul><li>Accessible</li><li>Usable</li><li>Interactive</li></ul></p><p><strong>Accessibility</strong></p><ul><li>Accessibility means easy to use anywhere. With more technologies (PDA's, Cell Phone, even console gaming systems) hooking into the internet you need your web site to work across all of these platforms. An accessible web site will.</li><li>Accessibility means better search ranking. Over 50% of web site traffic comes from people using search engines like Google.com. When your web site is accessible it's not only easier for people to read, it's easier for search engines to read - and that means better rankings.</li><li>Accessibility is the law. law requires that all businesses are handicap accessible - that includes your web site. This means passing certain standards that almost every web site on the internet does not meet. In fact, many government web sites still don't pass.</li></ul><p><strong>Usability</strong></p><ul><li>Usability means people can use your site. While sounding like a joke, far too many web sites have so much glitz and glamour put into the design of the site that people often simply don't know what to do. When 'Joe Customer' can't find the Home button, he's leaving.</li><li>Usability means communicating to the customer. Most people come to a web page looking for info. If they don't find it - or start to find it - within 7-20 seconds, they're going to go elsewhere. When your site is usable, your message will get across to the customer quicker and with more potency.</li><li>Usability means it's easy to update. If you've had a web site made before, you'll know that no web site is ever complete. They require upkeep and maintenance to keep them fresh. Designed with usability in mind, your web site will be easier and faster to update.</li></ul><p><strong>Interactivity</strong></p><ul><li>Interactivity means communicating with the customer. Web sites are not print material. It can change and involve your customers in ways that no other medium can. A productive web site will not only sell your product, but will keep selling it.</li><li>Interactivity does not mean Flash intros. Flash has it's place on the web - but it's not in over sized and pointlessly annoying web site intros. Just like animated GIFs, their existence alone is not enough to justify their use.</li></ul><p><strong>Last but not the least</strong> It is only once you combine all of these three things - accessibility, usability, and interactivity - into a single product that you will have an effective website. I strive to bring this unity to every project. As a creative web programmer with a strong technological foundation, I have demonstrated success in inventive problem solving. My resourcefulness and ability to learn quickly benefits my teammates and I thrive in collaborative environments. I have a passion for researching the latest trends, excel in their implementation, and love to create compelling Web Application/ Web Sites and user experiences.</p><p><strong>Quick run down of my Skills</strong>&nbsp;:</p><p><strong>Language</strong></p><ul><li>PHP</li><li>XML</li><li>HTML 5, HTML, XHTML and CSS2.0/3.0 with W3C standards compliant</li><li>Javascript</li></ul><div><strong>Database </strong></div><div><ul><li>MySql</li></ul><div><strong>Frameworks</strong></div></div><div><ul><li>Zend Framework</li><li>cakePHP</li><li>CodeIgniter</li><li>Smarty</li></ul></div><p><strong>Free/Open Source Software(F/OSS)</strong></p><ul><li>Drupal</li><li>AngularJS</li><li>NodeJS</li><li>Solr</li><li>jQuery</li><li>Json</li></ul><div><strong>Development Software</strong></div><div><ul><li>LAMP</li><li>WAMP</li><li>SVN</li><li>MySql Workbench</li><li>Eclipse</li><li>Zend Studio</li></ul></div><p><strong>Member Area</strong></p><ul><li><a href='https://www.drupal.org/u/aryashreep'>Drupal</a></li><li><a href='http://www.slideshare.net/AryaShree1'>Slideshare</a></li><li><a href='http://drupal.stackexchange.com/users/19880/aryashree-pritikrishna?tab=profile'>Stack Exchange</a></li><li><a href='https://github.com/aryashreep'>Github</a></li><li><a href='http://www.phpclasses.org/browse/author/561894.html'>PHPclasses</a></li></ul></div></div></div></div>",
      "categories": [
        "portfolio"
      ],
      "tags": [
        "PHP",
        "Drupal"
      ]
    }
]
